app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles"  WHERE (title LIKE '%tese%') LIMIT 4 OFFSET 0
SELECT COUNT(*) FROM "articles"  WHERE (title LIKE '%%')
---
  def index
    @articles = Article.search(params[:search]).paginate(:page => params[:page], :per_page => 4)

SELECT  "comments".* FROM "comments"  WHERE "comments"."article_id" = ?  ORDER BY "comments"."id" ASC LIMIT 1 OFFSET 0  [["article_id", 1]]
SELECT COUNT(*) FROM "comments"  WHERE "comments"."article_id" = ?  [["article_id", 1]]
---
  def show
    @commentsShow = @article.comments.paginate(:page => params[:page], :per_page => 4)

SELECT  "articles".* FROM "articles"  WHERE "articles"."user_id" = ? AND "articles"."id" = ?  ORDER BY published_at DESC, title ASC LIMIT 1  [["user_id", 1], ["id", 6]]
---
  def edit
    @article = current_user.articles.find(params[:id])

INSERT INTO "articles" ("body", "created_at", "excerpt", "location", "published_at", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @article = current_user.articles.new(article_params)
    respond_to do |format|
      if @article.save

SELECT  "articles".* FROM "articles"  WHERE "articles"."user_id" = ? AND "articles"."id" = ?  ORDER BY published_at DESC, title ASC LIMIT 1  [["user_id", 1], ["id", 6]]
UPDATE "articles" SET "excerpt" = ?, "location" = ?, "title" = ?, "updated_at" = ? WHERE "articles"."id" = 1  [["excerpt", ""], ["location", ""], ["title", "First Article Edited"], ["updated_at", "2015-12-04 13:46:57.382697"]]
---
  def update
    @article = current_user.articles.find(params[:id])
    respond_to do |format|
      if @article.update(article_params)