app/controllers/categories_controller.rb

  def index
    @categories = Category.search(params[:search]).paginate(:page => params[:page], :per_page => 20)
---
SELECT  "categories".* FROM "categories"  WHERE (name LIKE '%%')  ORDER BY categories.name LIMIT 20 OFFSET 0

  def show
    if params[:id]
      @categories = Category.all
      @categoryFind = Category.find params[:id]
      @articles = @categoryFind.articles.search(params[:search]).paginate(:page => params[:page], :per_page => 4)
---
SELECT "categories".* FROM "categories"   ORDER BY categories.name
SELECT  "categories".* FROM "categories"  WHERE "categories"."id" = ?  ORDER BY categories.name LIMIT 1  [["id", 2]]
SELECT  "articles".* FROM "articles" INNER JOIN "articles_categories" ON "articles"."id" = "articles_categories"."article_id" WHERE "articles_categories"."category_id" = ?  ORDER BY "articles"."id" ASC LIMIT 1 OFFSET 0  [["category_id", 3]]