app/controllers/profile_controller.rb

SELECT  "profiles".* FROM "profiles"  WHERE "profiles"."id" = ? LIMIT 1  [["id", 2]]
UPDATE "profiles" SET "bio" = ?, "birthday" = ?, "colour" = ?, "name" = ?, "twitter" = ?, "updated_at" = ? WHERE "profiles"."id" = 2  [["bio", "Update to bio"], ["birthday", "2020-08-19"], ["colour", ""], ["name", "johnatha"], ["twitter", "@JFrenchy91"], ["updated_at", "2018-12-18 23:18:23.060355"]]
---
  def update
    @profile = Profile.find(params[:id])
    respond_to do |format|
      if @profile.update(profile_params)