app/views/categories/show.html.erb


          <% article.categories.each do |category| %>
---
SELECT "categories".* FROM "categories" INNER JOIN "articles_categories" ON "categories"."id" = "articles_categories"."category_id" WHERE "articles_categories"."article_id" = ?  ORDER BY categories.name  [["article_id", 1]]

          <p style="font-size: 25px; color: cornflowerblue; ">
            <%= article.title %> <small style="color:black; font-size: small;">(<%= article.comments.count %>  <% if article.comments.count > 1  or article.comments.count == 0%> Comments <% else %> Comment <% end %>)</small>
---
SELECT COUNT(*) FROM "comments"  WHERE "comments"."article_id" = ?  [["article_id", 1]]